In [7]:
import sqlalchemy as db
import pandas as pd

In [5]:
engine = db.create_engine('sqlite:///test.sqlite')
metadata = db.MetaData()
connection = engine.connect()
emp = db.Table('emp', metadata, autoload=True, autoload_with=engine)

In [8]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name   salary  active
0   1   vinay  60000.0    True
1   1  satvik  60000.0    True
2   1  naveen  60000.0    True
3   2   rahul  80000.0   False

In [12]:
# Build a statement to update the salary to 100000
query = db.update(emp).values(salary = 100000)
query = query.where(emp.columns.Id == 1)
results = connection.execute(query)

In [13]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1   vinay  100000.0    True
1   1  satvik  100000.0    True
2   1  naveen  100000.0    True
3   2   rahul   80000.0   False